# Books (Core)

In [17]:
import pandas as pd
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
connection = "mysql+pymysql://root:root@localhost/book"

In [18]:
engine = create_engine(connection)

In [19]:
database_exists(connection)

False

In [20]:
# Check if the database exists. If not, create it.
if database_exists(connection) == False:
  create_database(connection)
else:
  print('The database already exists')

## Import datasets

In [21]:
users_url = "https://docs.google.com/spreadsheets/d/1_c2WTx_eiH8pUM-PTgyt7T4aIl1A3Cp1ukPVPEijoYc/gviz/tq?tqx=out:csv&sheet=users"
users = pd.read_csv(users_url)
users.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [22]:
books_url = "https://docs.google.com/spreadsheets/d/1_D-vW7GXiQfG6D9nzjscgVctKLb6TZl_o8ERNH_tet8/gviz/tq?tqx=out:csv&sheet=books"
books = pd.read_csv(books_url)
books.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [23]:
favorite_url = "https://docs.google.com/spreadsheets/d/1SLb3RAhcrZsPWRwR0_njWX7KssUYZ16JFsVqBkSU2GI/gviz/tq?tqx=out:csv&sheet=favorite"
favorite = pd.read_csv(favorite_url)
favorite.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [33]:
authors_url = "https://docs.google.com/spreadsheets/d/17rABPt5eaIxfhGO75dYCbH-5IloKsAR0HH9V6VC43ZI/gviz/tq?tqx=out:csv&sheet=authors"
authors = pd.read_csv(authors_url)
authors.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

## Convert data to SQL

In [34]:
books.to_sql('books', engine, index=False, if_exists = 'replace')

6

In [35]:
users.to_sql('users', engine, index=False, if_exists = 'replace')

3

In [36]:
favorite.to_sql('favorite', engine, index=False, if_exists = 'replace')

7

In [37]:
authors.to_sql('authors', engine, index=False, if_exists = 'replace')

5

## Show tables of new SQL file

In [56]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_book
0        authors
1          books
2       favorite
3          users

## Display users favorite books

In [68]:
q = """SELECT books.title, favorite.user_id
FROM books 
JOIN favorite ON books.id = favorite.book_id
WHERE favorite.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));"""
pd.read_sql(q, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1